[
  {
    "week": 1,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It took a while, but the Huskies overcame a sluggish first half in which they led 10-7 at the break and overwhelmed Rutgers in the second half for a satisfying 30-14 nonconference road win. UW must shore up the running game, which gained just 84 yards and find alternate downfield receiving targets other than Dante Pettis.<p><strong>This week:</strong>&nbsp;Against Montana."
  },
  {
    "week": 1,
    "ranking": 2,
    "team": "USC",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Trojans led 35-31 with 4:37 remaining before a pair of late touchdowns sealed a 49-31victory over Western Michigan at The Coliseum. The Trojans won’t stay unbeaten for long unless they fix a leaky run defense that allowed 263 yards. QB Sam Darnold tossed 2 INTs and failed to throw a touchdown in his first start, which put a chill on his Heisman Trophy campaign. <p><strong>This week:</strong>&nbsp; Against Stanford."
  },
  {
    "week": 1,
    "ranking": 3,
    "team": "Stanford",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It’s easy to forget the Cardinal pounded Rice 62-7 in its opener because it was on August 27 and the game was played on the other side of the globe. But Stanford did have the most complete season debut in the conference. The defense nearly had a shutout, RB Bryce Love ran for 180 yards and QB Keller Chryst passed for 253. <p><strong>This week:</strong>&nbsp; At USC.\n "
  },
  {
    "week": 1,
    "ranking": 4,
    "team": "UCLA",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>This is probably a little too high for the Bruins, but did you see that incredible 45-44 win over Texas A&M? The Bruins trailed 44-10 late in the third quarter and had a 0.5 probability to win the game. It was the second largest comeback in NCAA history thanks in large part to QB Josh Rosen. However, can Rosen’s heroics continue to save a defense that allowed 382 yards rushing? <p><strong>This week:</strong>&nbspAgainst Hawaii."
  },
  {
    "week": 1,
    "ranking": 5,
    "team": "Washington State",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The long wait is over. Mike Leach finally won a season opener with the Cougars. And QB Luke Falk (33 of 39 for 311 yards, 3 TDs and 0 INT) looked terrific in an 31-0 victory against overmatched FCS opponent Montana State. WSU allowed just 28 passing yards, which is the fewest since 1996. <p><strong>This week:</strong>&nbsp Against Boise State."
  },
  {
    "week": 1,
    "ranking": 6,
    "team": "California",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>No one expects the Golden Bears to finish in the top half of the rankings at the end of the season. But then, no one gave them much of a chance to win 35-30 at North Carolina. Don’t tell new coach Justin Wilcox that this is a rebuilding year. The defense, which allowed 440 yards, still needs a lot of work. But if new QB Ross Bowers (363 yards, 4 TDs, 2 INTs) can cut down on the miscues, then maybe Cal can make it to a bowl game. <p><strong>This week:</strong>&nbsp Against Weber State."
  },
  {
    "week": 1,
    "ranking": 7,
    "team": "Colorado",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Buffaloes defense was supposed to struggle after losing its coordinator Jim Leavitt to Oregon and needing to replace eight departing starters. But Colorado nearly shutout Colorado State in a 17-3 victory a week after the Rams rolled up 58 points on Oregon State. RB Phillip Lindsay (19 carries, 140 yards, 1 TD) is a gem. <p><strong>This week:</strong>&nbsp Against Texas State."
  },
  {
    "week": 1,
    "ranking": 8,
    "team": "Oregon",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Willie Taggart era started with a bang – or more precisely a 100-yard kickoff return from Tony Brooks-James. The Ducks trounced Southern Utah 77-21 – the most points since 1916 – while piling up 703 yards. They scored 21 points in each of the first three quarters. RB Royce Freeman (23 carries, 150 yards, 4 TDs) and QB Justin Herbert (281 passing yards) looked incredible. But it was against Southern Utah. <p><strong>This week:</strong>&nbspAgainst Nebraska."
  },
  {
    "week": 1,
    "ranking": 9,
    "team": "Utah",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It’s just one game – against an FCS opponent at that  – but maybe, just maybe the Utes have found a quarterback in Tyler Huntley. He completed 23 of 32 passes for 237 yards, 1 TD and 1 INT during a 37-16 victory. Keep in mind, Rosen had more yards in the fourth quarter alone. But this is Utah. And the Utes have been looking for a QB since Brian Johnson left in 2008. <p><strong>This week:</strong>&nbsp; At BYU."
  },
  {
    "week": 1,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Wildcats ran wild (506 yards) over Northern Arizona for a 62-24 victory. No real surprise there. But what about the passing game? QB Brandon Dawkins (7 for 13, 89 yards, 1 TD) doesn't look as if he’s progressed much as a passer. Another potential problem, the Cats allowed 377 passing yards. <p><strong>This week:</strong>&npsp Against Houston."
  },
  {
    "week": 1,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>Depth could be an issue for the Sun Devils, which used just 11 defensive players during the first half of their 37-31 win over New Mexico State. Coach Todd Graham: “When we've got guys we can rotate, we're going to rotate. Until they perform in practice, the 1s are going to play a lot of plays.\" Good luck with that. <p><strong>This week:</strong>&nbsp; Against San Diego State."
  },
  {
    "week": 1,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>If the Beavers didn’t make a 17-yard FG with 1:08 left and Portland State hadn’t missed a game-tying boot as time expired, then OSU would be 0-2 and staring at a daunting schedule that includes three straight ranked Pac-12 opponents (WSU, UW, USC) when league play begins next week. The Beavers allowed 525 yards in opener to Colorado State and 515 to PSU. <p><strong>This week:</strong>&nbsp; Against Minnesota."
  },
  {
    "week": 2,
    "ranking": 1,
    "team": "USC",
    "blurb": "<strong>Record:</strong>&nbsp;2-0, 1-0<p>If not for penalties (8 for 90 yards), their 42-24 win over then-No. 14 Stanford would have been a bigger blowout. <p><strong>This week:</strong>&nbsp; Against Texas."
  },
  {
    "week": 2,
    "ranking": 2,
    "team": "Washington",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>Through no fault of their own, the Huskies slide out of the top spot.<p><strong>This week:</strong>&nbsp; Against Freno State."
  },
  {
    "week": 2,
    "ranking": 3,
    "team": "UCLA",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>For the second straight week, a phenomenal performance from QB Josh Rosen overcomes a shoddy defensive effort. <p><strong>This week:</strong>&nbsp; At Memphis."
  },
  {
    "week": 2,
    "ranking": 4,
    "team": "Stanford",
    "blurb": "<strong>Record:</strong>&nbsp;1-1, 0-1<p>Not sure if problem with passing game is QB Keller Chryst, completing 55.8 percent, or the receivers. <p><strong>This week:</strong>&nbsp; At San Diego State."
  },
  {
    "week": 2,
    "ranking": 5,
    "team": "Washington State",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>Comeback during a 47-44 3OT win over Boise State was epic but QB Luke Falk was benched. <p><strong>This week:</strong>&nbsp; Against Oregon State."
  },
  {
    "week": 2,
    "ranking": 6,
    "team": "Colorado",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>A retooled defense has not surrendered a TD this season and ranks second nationally in points allowed. <p><strong>This week:</strong>&nbsp; Against Northern Colorado."
  },
  {
    "week": 2,
    "ranking": 7,
    "team": "Oregon",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>If Ducks hadn’t allowed three late touchdowns in their 42-35 win over Nebraska, they might have returned to Top 25. <p><strong>This week:</strong>&nbsp; At Wyoming."
  },
  {
    "week": 2,
    "ranking": 8,
    "team": "Utah",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p> Tyler Huntley just might be a star in the making. The true freshman QB had 389 total yards in a 19-13 win at BYU. <p><strong>This week:</strong>&nbsp; Against San Jose State."
  },
  {
    "week": 2,
    "ranking": 9,
    "team": "California",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>It may have been an overreaction to put Cal sixth in the rankings last week after a 35-30 win at North Carolina. <p><strong>This week:</strong>&nbsp; Against Mississippi."
  },
  {
    "week": 2,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>Ran for 506 yards in a 62-24 win over Northern Arizona in opener, but held to 152 rushing yards in loss to Houston. <p><strong>This week:</strong>&nbsp; At UTEP."
  },
  {
    "week": 2,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>The Sun Devils surrendered 216 yards to San Diego State RB Rashaad Penny during a 30-20 loss. <p><strong>This week:</strong>&nbsp; At Texas Tech."
  },
  {
    "week": 2,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record:</strong>&nbsp;1-2<p>The Beavers were shut out in the second half of their 48-14 loss to Minnesota.\n<p><strong>This week:</strong>&nbsp; At Washington State."
  },
  {
    "week": 3,
    "ranking": 1,
    "team": "USC",
    "blurb": "<strong>Record: 3-0, 1-1</strong><p>Somebody give Chase McGrath a scholarship. Like, right now. The freshman walk-on kicker booted a 31-yard field with time expiring to force overtime and then nailed a 43-yarder in the second overtime to give the Trojans a 27-24 win over Texas. Before the season, USC had what appeared to be the toughest first three games in the Pac-12. But their opponents (including Western Michigan and Stanford) are each 1-2.<p><strong>This week:</strong>&nbsp; At California"
  },
  {
    "week": 3,
    "ranking": 2,
    "team": "Washington",
    "blurb": "<strong>Record: 3-0 </strong><p>Surprisingly, Teamrankings.com ranks UW’s non-conference schedule 57th in the nation – stronger than Oregon State (60), Arizona (63), Oregon (78), Washington State (81), Colorado (82) and Utah (107). Collecting blowout wins like Saturday’s 48-16 victory over Fresno State should help the Huskies in the short term, but you get the feeling the absence of a signature out-of-conference performance will hurt them in CFP talks. FYI, the first CFP rankings is Oct. 31. <p><strong>This week:</strong>&nbsp:  At Colorado"
  },
  {
    "week": 3,
    "ranking": 3,
    "team": "Washington State",
    "blurb": "<strong>Record: 3-0, 1-0</strong><p>QB Luke Falk shook off last week’s benching and resumed his assault on the Pac-12 record books. He passed for 396 yards and 6 TDs in a 52-23 win over Oregon State. He has 98 TDs in his career, just 18 away from the conference record. Junior WR Tavares Martin Jr. had a monster day with 10 catches for 194 yards and 3 TDs. The Cougars improve to 3-0 for first time under coach Mike Leach, but losing senior LB Peyton Pelluer for the season with a broken foot put a downer on a big win.<p><strong>This week:</srong>&nbsp; Against Nevada"
  },
  {
    "week": 3,
    "ranking": 4,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-0</strong><p>The Buffaloes gave up their first touchdown in a 41-21 win over Northern Colorado. CU allowed just three points in each of the previous two games. Sophomore QB Steven Montez had his best game of his career while accumulating 425 yards and tossed 4 TDs. <p><strong>This week;</srong>&nbsp: Against Washington"
  },
  {
    "week": 3,
    "ranking": 5,
    "team": "Oregon",
    "blurb": "<strong>Record: 3-0</strong><p>Feels as if not enough people are paying attention to the Ducks, even after their 49-13 win over Wyoming – their third game scoring at least 42 points. Sophomore QB Justin Herbert is looking like a NFL quarterback and there’s no doubt RB Royce Freeman will play on Sundays. The defense held highly-touted Wyoming QB Josh Allen to 9-for-24 passing and 64 yards, including an interception. <p><strong>This week:</srong>&nbsp; At Arizona State"
  },
  {
    "week": 3,
    "ranking": 6,
    "team": "Utah",
    "blurb": "<strong>Record: 3-0</strong><p>After throwing for 341 yards and four touchdowns in a 54-16 win over San Jose State, QB Tyler Huntley became the first Utah QB since Brian Johnson to have 300-yard passing games in back-to-back outings. WR Darren Carrington II, who transferred from Oregon, recorded his third straight 100-yard receiving game, finishing with 153 yards and 3 TDs. <p><strong>This week:</srong>&nbsp; Against Stanford"
  },
  {
    "week": 3,
    "ranking": 7,
    "team": "California",
    "blurb": "<strong>Record: 3-0</strong><p>Not sure whether to buy stock in the Golden Bears or not. But they’re undefeated heading into Pac-12 play after a 27-16 win over Mississippi. Cal has overcome second-half deficits in all three games and has outscored the opposition 57-13 after halftime. This time, the Golden Bears were down 16-7 at halftime before shutting out the Rebels in the second half. <p><strong>This week:</srong>&nbsp; Against USC"
  },
  {
    "week": 3,
    "ranking": 8,
    "team": "Stanford",
    "blurb": "<strong>Record: 1-2, 0-1</strong><p>The lights went out at Qualcomm Stadium, which briefly suspended the Cardinal’s 20-17 loss to San Diego State. But in truth, Stanford’s offense has suffered from a power outage all season. Stanford ranks 11th in the Pac-12 in offense and passing offense. Coach David Shaw may not want to admit it, but his team has issues at QB. <p><strong>This week:</srong>&nbsp; Against UCLA"
  },
  {
    "week": 3,
    "ranking": 9,
    "team": "UCLA",
    "blurb": "<strong>Record: 2-1 </strong><p> Can Josh Rosen play defense? That’s a joke, but not really. Not after the Bruins allowed 560 yards in a 48-45 loss at Memphis. Rosen tossed a pick-six in the third quarter, which was one of 2 INTs. But he also finished with 463 yards on 34-of-56 passing, 4 TDs and 2 INTs. He’s averaging 428 yards and 4 TDs this season. <p><strong>This week:</srong>&nbsp; At Stanford"
  },
  {
    "week": 3,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record: 2-1</strong><p>For the second time this season, the Wildcats ran for more than 500 yards, which is fairly amazing in and of itself. But they ran roughshod over two winless teams - Northern Arizona in the opener, and in a win over UTEP last week. It remains to be seen if Arizona can continue its success in the run game against a formidable Pac-12 foe. Still, QB Brandon Dawkins was amazing last week while passing for 3 TDs and running for 3 TDs.<p><strong>This week:</srong>&nbsp; Against Utah"
  },
  {
    "week": 3,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record: 1-2</strong><p>The Sun Devils surrendered 543 passing yards and 6 TDs to QB Nic Shimonek during a 52-45 defeat that could be the start of a long losing streak, as coach Todd Graham's seat continues to get hotter. They likely won’t be favored in the next seven games. And four of their next five games are against ranked teams. <p><strong>This week:</strong>&nbsp; Against Oregon"
  },
  {
    "week": 3,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-3, 0-1</strong><p>The bad news: Not sure if the Beavers will win another game this season. And this was supposed to be the year they snapped a four-year bowl drought. The good news: QB Jake Luton has been discharged from the hospital after suffering what appeared to be a bad injury when he collided with WSU safety Jalen Thompson early in the fourth quarter. <p><strong>This week:</strong>&nbsp; bye"
  },
  {
    "week": 4,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>Apparently, the concern about the running game was overblown. Myles Gaskins had 152 yards in his first three games, but pounded Colorado for a career-high 202 in a 37-10 win at Colorado. UW's defense collected three interceptions and five sacks while moving to first in the Pac-12 in points allowed (11.8). Mounting injuries (Byron Murphy, Lavon Coleman, Chico McClatcher and Drew Sample) could be troublesome, though.<p><strong>This week:</strong>&nbsp; At Oregon State"
  },
  {
    "week": 4,
    "ranking": 2,
    "team": "USC",
    "blurb": "<strong>Record: 4-0, 2-0</strong><p>For the second straight week, the Trojans lived dangerously and had trouble putting away an overmatched opponent. This time, USC was tied 13-13 early in the fourth quarter at Cal before outscoring the Golden Bears 17-7 for a 30-20 victory. Without injured RB Ronald Jones II, QB Sam Darnold had to carry the offense and Cal held him in check. Last year, the Trojans were 1-3. They have since won 13 straight games, which is the team’s longest streak since former coach Pete Carroll won 34 straight a decade ago.<p><strong>This week:</strong>At Washington State"
  },
  {
    "week": 4,
    "ranking": 3,
    "team": "Washington State",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>QB Luke Falk put on a clinic while passing for 478 yards and 5 TDs in a 45-7 nonconference win over Nevada. At his current pace, Falk needs four games to break the Pac-12’s career record in passing yards and TDs. Falk and the Cougs will have a big test on Friday against USC, which has won its last five games in Pullman. <p><strong>This week:</strong>&nbsp; Against USC"
  },
  {
    "week": 4,
    "ranking": 4,
    "team": "Utah",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>Following an ugly 30-24 win at Arizona, the Utes head into the bye with two priorities: Get QB Tyler Huntley healthy and clean up the penalties. Huntley left last Saturday’s game in second quarter due to an injured shoulder, which forced the Utes to rely on five turnovers to secure the win. <p><strong>This week:</strong>&nbsp; bye"
  },
  {
    "week": 4,
    "ranking": 5,
    "team": "Stanford",
    "blurb": "<strong>Record: 2-2, 1-1</strong><p>The bad news: Not sure if the Beavers will win another game this season. And this was supposed to be the year they snapped a four-year bowl drought. The good news: QB Jake Luton has been discharged from the hospital after suffering what appeared to be a bad injury when he collided with WSU safety Jalen Thompson early in the fourth quarter. <p><strong>This week:</strong>&nbsp; Against Arizona State"
  },
  {
    "week": 4,
    "ranking": 6,
    "team": "California",
    "blurb": "<strong>Record: 3-1, 0-1</strong><p>The Golden Bears suffered their first loss, but new coach Justin Wilcox looks to have transformed a defense that ranked last in the Pac-12 and 127th in the country last year in points per game (42.6). If QB Ross Bowers hadn’t tossed 4 INTs and lost two fumbles against USC, then the Bears might still be undefeated.<p><strong>This week:</strong>&nbsp; At Oregon"
  },
  {
    "week": 4,
    "ranking": 7,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-1, 0-1</strong><p>QB Steven Montez was exceptionally accurate on short passes against Washington when he completed 21 of 27 throws. But he made a costly error on a short throw that was intercepted and returned for a touchdown. Montez finished with just 171 yards and three interceptions, including a pick in the end zone on a long throw. He was also sacked four times. The reigning South division champion can’t afford another setback if it wants to keep pace with USC.<p><strong>This week:</strong>&nbsp; At UCLA"
  },
  {
    "week": 4,
    "ranking": 8,
    "team": "Arizona State",
    "blurb": "<strong>Record: 2-2, 1-0</strong><p>No one is going to forget the non-conferences losses to San Diego State and Texas Tech, but Saturday’s 37-35 upset win over then-No. 24 Oregon cooled the hot seat that coach Todd Graham has been sitting on. ASU was a 13-point underdog, but it led for most of the game and went up by 17 early in the third before trailing by a point in the final minutes.<p><strong>This week:</strong>&nbsp; At Stanford"
  },
  {
    "week": 4,
    "ranking": 9,
    "team": "Oregon",
    "blurb": "<strong>Record: 3-1, 0-1</strong><p>The Ducks are developing a reputation as an undisciplined team under first-year coach Willie Taggart. Oregon is the second-most penalized team in the country with 42. Only Troy (43) has more. Last Saturday, the Ducks were flagged 17 times – 3 were declined – for 99 yards.<p><strong>This week:</strong>&nbsp; Against Califo"
  },
  {
    "week": 4,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record: 2-2, 0-1</strong><p>Don’t write off the Wildcats just yet. If they turn things around, it will be because of a revamped defense filled with first-year performers that’s been surprisingly stingy. Arizona ranks fifth in the Pac-12 allowing 22.2 points per game, down from 38.3 last season. The Wildcats have five takeaways – just five fewer than they had in 2016. And Arizona is limiting opponents to a 35.7 percent conversion rate on third down. <p><strong>This week:</strong>&nbsp; bye"
  },
  {
    "week": 4,
    "ranking": 11,
    "team": "UCLA",
    "blurb": "<strong>Record: 2-2, 0-1</strong><p>In the past 15 games against Power 5 schools, the Bruins are 4-11 with wins against Utah, Arizona, Oregon State and Texas A&M. And we remember Josh Rosen’s heroics in that unbelievable comeback win against the Aggies. He torched Stanford for 480 yards and 3 TDs last Saturday, but couldn’t overcome 2 INTs and a shoddy defense. <p><strong>This week:</strong>&nbsp; Against Colorado"
  },
  {
    "week": 4,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-3, 0-1</strong><p>QB Jake Luton won’t return any time soon after suffering a thoracic spine fracture two weeks ago. Backup Darell Garretson, who was 2-4 as a starter in 2016, takes over.  <p><strong>This week:</strong>&nbsp; Against Washington"
  },
  {
    "week": 5,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record: 5-0, 2-0</strong><p>Don’t expect UW to fall out of this spot any time soon. It’s somewhat concerning that AP voters didn’t reward No. 6 Huskies for a blowout 42-7 win over Oregon State and bumped No. 5 Georgia ahead of them.<p><strong>This week:</strong>&nbsp; Against California"
  },
  {
    "week": 5,
    "ranking": 2,
    "team": "Washington State",
    "blurb": "<strong>Record: 5-0, 2-0</strong><p>Best start since 2001 when Cougars began 7-0 and finished 10-2. WSU has the most impressive win in the Pac-12 (a 30-27 victory over then-No. 5 USC), which pushes it into the College Football Playoff conversation.<p><strong>This week:</strong>&nbsp; At Oregon"
  },
  {
    "week": 5,
    "ranking": 3,
    "team": "Utah",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>Pac-12’s stingiest rushing defense (87.0 yards per game) faces the nation’s leading rusher in Stanford’s Bryce Love, who averages 217.6 yards per game. After bye last week, Utes QB Tyler Huntley had extra time to recover from shoulder injury that knocked him out of Sept. 22 game. <p><strong>This week:</strong>&nbsp; Against Stanford"
  },
  {
    "week": 5,
    "ranking": 4,
    "team": "USC",
    "blurb": "<strong>Record: 4-1, 2-1</strong><p>QB Sam Darnold says his confidence is shaken. Injuries are mounting, including the loss of three starting offensive lineman. The Trojans don’t have a bye this season and must play 12 straight games, which is ridiculous. But they should be able to rest some starters on Saturday. <p><strong>This week:</strong>&nbsp; Against Oregon State"
  },
  {
    "week": 5,
    "ranking": 5,
    "team": "Stanford",
    "blurb": "<strong>Record: 3-2, 2-1</strong><p>Love (1,088 rushing yards) is on pace to break Barry Sanders’s single-season rushing mark of 2,628 yards. Love, who broke Stanford’s single-game rushing record with 301 in last week’s 34-24 win over Arizona State, is averaging an absurd 11.1 yards per carry and has a touchdown run of at least 50 yards in the past seven games. <p><strong>This week:</strong>&nbsp; At Utah"
  },
  {
    "week": 5,
    "ranking": 6,
    "team": "UCLA",
    "blurb": "<strong>Record: 3-2, 1-1</strong><p>Biggest jump in the rankings following a gritty 27-23 win over Colorado punctuated by a defensive stand in the final minutes. That’s right, the Bruins, which rank last in the Pac-12 in yards allowed, played a little defense when it counted. And QB Josh Rosen threw for 372 yards – his fifth straight game with at least 350.<p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 5,
    "ranking": 7,
    "team": "Oregon",
    "blurb": "<strong>Record: 4-1, 1-1</strong><p>The Ducks are without QB Justin Herbert (collarbone) for next 4-6 weeks and backup quarterback Taylor Alie (concussion) was knocked out of last Saturday’s 45-24 win over Cal. Oregon may turn to true freshman Braxton Burmeister. It’s uncertain if RB Royce Freeman (shoulder) will be available Saturday. <p><strong>This week:</strong>&nbsp; Against Washington State"
  },
  {
    "week": 5,
    "ranking": 8,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-2, 0-2</strong><p>Following second straight defeat, fell to bottom of Pac-12 South standings. The Buffaloes have a chance to jump back into the division race with winnable games against Arizona and Oregon State. <p><strong>This week:</strong>&nbsp; Against Arizona"
  },
  {
    "week": 5,
    "ranking": 9,
    "team": "California",
    "blurb": "<strong>Record: 3-2, 0-2</strong><p>The Golden Bears are hitting a little bit of adversity, but if they don’t fall apart the next two weeks there’s still a chance they could qualify for a bowl game. <p><strong>This week:</strong>&nbsp; At Washington"
  },
  {
    "week": 5,
    "ranking": 10,
    "team": "Arizona State",
    "blurb": "<strong>Record: 2-3, 1-1</strong><p>Good time for a bye considering the next three games are against ranked teams (UW, Utah and USC). Things could turn real ugly in a hurry for coach Todd Graham who probably needs a winning season to return next year.  <p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 5,
    "ranking": 11,
    "team": "Arizona",
    "blurb": "<strong>Record: 2-2, 0-1</strong><p>My pick as the surprise team that’s going to make a run in the second half of the season. Not sure if the Wildcats will make it to a bowl game, but coach Rich Rodriguez is going to make things interesting.  <p><strong>This week:</strong>&nbsp; At Colorado"
  },
  {
    "week": 5,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-4, 0-2</strong><p>The Beavers will be hard pressed to win another game this season. Year 3 is an absolute mess for coach Gary Andersen, whose contract expires after 2021. Under Andersen, OSU is 7-22 overall, 3-17 in the Pac-12 and 0-13 on the road. <p><strong>This week:</strong>&nbsp; At USC"
  },
  {
    "week": 6,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record: 6-0, 3-0</strong><p>We love offense, but the nation’s top five FBS teams (Penn State, Georgia, UW, Alabama and Clemson) in defensive points allowed are ranked in the top five. Huskies are giving up just 10.2 points per game.<p><strong>This week:</strong>&nbsp; At Arizona State"
  },
  {
    "week": 6,
    "ranking": 2,
    "team": "Washington State",
    "blurb": "<strong>Record: 6-0, 3-0</strong><p>If judging their competition and the results, then Cougars can make a strong case to be at the top of this ranking. This is shaping up to be a magical season for a program that’s had a 10-win season just five times since 1917.<p><strong>This week:</strong>&nbsp; At California"
  },
  {
    "week": 6,
    "ranking": 3,
    "team": "USC",
    "blurb": "<strong>Record: 5-1, 3-1</strong><p>QB Sam Darnold passed for 316 yards and three touchdowns during a 38-10 win over Oregon State. But he also tossed his ninth INT and should have two others picked off. Brutal schedule could wreck Pac-12 title aspirations.<p><strong>This week:</strong>&nbsp; Against Utah"
  },
  {
    "week": 6,
    "ranking": 4,
    "team": "Stanford",
    "blurb": "<strong>Record: 4-2, 3-1</strong><p>Admit it, you wrote them off after a 1-2 start. But the Cardinal will have a say in who wins the Pac-12 North and will likely finish the season with 10 wins for seventh time in the past eight years. Still, pedestrian play at quarterback could prove to be fatal.<p><strong>This week:</strong>&nbsp; Against Oregon"
  },
  {
    "week": 6,
    "ranking": 5,
    "team": "Utah",
    "blurb": "<strong>Record: 4-1, 1-1</strong><p>Not nearly dynamic enough offensively without QB Tyler Huntley who sat out last week due to a shoulder injury. He averaged 360 all-purpose yards in first three games. Without him, Utes don’t have enough to beat the Pac-12 elite teams<p><strong>This week:</strong>&nbsp; At USC"
  },
  {
    "week": 6,
    "ranking": 6,
    "team": "Arizona",
    "blurb": "<strong>Record: 3-2, 1-1</strong><p>Biggest jump in the rankings thanks to backup QB Khalil Tate, who rushed for 327 yards, an FBS record by a QB, and accounted for five TDs in a 45-42 win over Colorado. I’m guessing he’ll get the start over Brandon Dawkins in the next outing.<p><strong>This week:</strong>&nbsp; Against UCLA"
  },
  {
    "week": 6,
    "ranking": 7,
    "team": "UCLA",
    "blurb": "<strong>Record: 3-2, 1-1</strong><p>Jim Mora is a defensive-minded coach, but the Bruins are 127th among FBS teams in yards allowed (506.6), 120th in points allowed (39.2) and they’ve been called for four of the nine targeting penalties upheld against Pac-12 teams.<p><strong>This week:</strong>&nbsp; At Arizona"
  },
  {
    "week": 6,
    "ranking": 8,
    "team": "Oregon",
    "blurb": "<strong>Record: 4-2, 1-2</strong><p>Without QB Justin Herbert, who is out the next 3-5 weeks due to a collarbone injury, the Ducks offense managed just 10 points led by true freshman Braxton Burmeister during a loss to WSU. Off the field, new coach Willie Taggert has assembled the nation’s No. 1 recruiting class for 2018.<p><strong>This week:</strong>&nbsp; At Stanford"
  },
  {
    "week": 6,
    "ranking": 9,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-3, 0-3</strong><p>Buffaloes can run the ball with RB Phillip Lindsay who carried 41 times for 281 yards in loss to Arizona. However, they can’t protect QB Steven Montez who was sacked four times last week and 16 this season. As crazy as it my sound, Colorado can still win the South Division.<p><strong>This week:</strong>&nbsp; At Oregon State"
  },
  {
    "week": 6,
    "ranking": 10,
    "team": "Arizona State",
    "blurb": "<strong>Record: 2-3, 1-1</strong><p>It’s make-or-break time for the Sun Devils and coach Todd Graham, who has come under fire. ASU was off last week and conceivably they fixed an offensive line that was ranked next to last in the country allowing 21 sacks.<p><strong>This week:</strong>&nbsp; Against Washington"
  },
  {
    "week": 6,
    "ranking": 11,
    "team": "California",
    "blurb": "<strong>Record: 3-3, 0-3</strong><p>QB Ross Bowers has struggled and looked progressively worse in three straight losses, but benching him would be a bad idea. The Golden Bears have lots of problems on the O-line – they allowed 8 sacks against UW – and they’ve lost 3 of their top 4 receivers to injuries.<p><strong>This week:</strong>&nbsp; Against Washington State"
  },
  {
    "week": 6,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-5, 0-3</strong><p>Quite possibly the worst team among the Power 5 conferences. Showed some fight and resolve in 38-10 loss to USC, but that 28-point defeat was their closest game all season. And to top things off, head coach Gary Anderson is leaving the program.<p><strong>This week:</strong>&nbsp; Against Washington State"
  },
  {
    "week": 7,
    "ranking": 1,
    "team": "USC",
    "blurb": "<strong>Record: 6-1, 4-1</strong><p>The Trojans have looked lethargic and disinterested at times, but their only loss is a three-point defeat at WSU on a short week in the second of two road games. Important game this week at No. 13 Notre Dame (5-1), which is likely a CFP eliminator for the loser.<p><strong>This week:</strong>&nbsp; At Notre Dame"
  },
  {
    "week": 7,
    "ranking": 2,
    "team": "Stanford",
    "blurb": "<strong>Record: 5-2, 4-1</strong><p>The Cardinal’s four straight wins is the longest winning streak in the Pac-12. Stanford clobbered Oregon 49-7 thanks to Heisman Trophy front-runner Bryce Love and QB Keller Chryst (15 of 21 passes for 181 yards and 3 TDs) who had his best game of the season.<p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 7,
    "ranking": 3,
    "team": "Washington",
    "blurb": "<strong>Record: 6-1, 3-1</strong><p>Despite the naysayers following a 13-7 upset loss at ASU, the Huskies can still return to the CFP if they run the table. But they’ll need help. And they need to find a kicker to jump start the offense and overcome season-ending injuries to OT Trey Adams and CB Jordan Miller. <p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 7,
    "ranking": 4,
    "team": "Washington State",
    "blurb": "<strong>Record: 6-1, 3-1</strong><p>Fair to wonder if athletic director Bill Moos, who bolted to Nebraska, will lure coach Mike Leach away from the Cougars. It’s a distraction that WSU doesn’t need after an embarrassing 37-3 loss at California. <p><strong>This week:</strong>&nbsp; Against Colorado"
  },
  {
    "week": 7,
    "ranking": 5,
    "team": "Arizona",
    "blurb": "<strong>Record: 4-2, 2-1 </strong><p>In Khalil Tate, coach Rich Rodriguez may have found his next Pat White, the dual-threat QB who led Rodriguez’s spread offense to prominence at West Virginia. Tate was sensational two weeks ago (327 rushing yards and 5 five TDs) and brilliant again last Saturday (230 rushing yards and 3 TDs) in his first start. <p><strong>This week:</strong>&nbsp; At California"
  },
  {
    "week": 7,
    "ranking": 6,
    "team": "Utah",
    "blurb": "<strong>Record: 4-2, 1-2 </strong><p>Coach Kyle Whittingham made the right call when he opted for a two-point conversion attempt with 42 seconds remaining in a 28-27 loss at USC. Still, Utes need QB Tyler Huntley who has missed past two games due to a shoulder injury. <p><strong>This week:</strong>&nbsp; Against Arizona State"
  },
  {
    "week": 7,
    "ranking": 7,
    "team": "California",
    "blurb": "<strong>Record: 4-2, 1-3 </strong><p>Their 37-3 win over WSU, which included 9 sacks and 5 TOs, was the best win of the decade for the Golden Bears. Cal leads FBS teams with 20 takeaways.<p><strong>This week:</strong>&nbsp; Against Arizona"
  },
  {
    "week": 7,
    "ranking": 8,
    "team": "Arizona State",
    "blurb": "<strong>Record: 3-3, 2-1 </strong><p>After allowing 30 points in each of their last 11 games, nearly pitched a shutout against Washington in an upset victory that sparked the first storming-the-field celebration since 2007. Still, not convinced Sun Devils won’t finish at the bottom of the Pac-12 South. They’re winless in their past nine Pac-12 road games dating back to 2015.<p><strong>This week:</strong>&nbsp; At Utah"
  },
  {
    "week": 7,
    "ranking": 9,
    "team": "Colorado",
    "blurb": "<strong>Record: 4-3, 1-3 </strong><p>Avoided a disastrous 0-4 start with a comeback 36-33 win in the final minutes at Oregon State. RB Phillip Lindsay, who has 810 rushing yards this season, has 466 in the past two games.<p><strong>This week:</strong>&nbsp; At Washington State"
  },
  {
    "week": 7,
    "ranking": 10,
    "team": "UCLA",
    "blurb": "<strong>Record: 3-3, 1-2 </strong><p>Coach Jim Mora is 5-13 (.384) against his last 18 Power 5 opponents. The Bruins are wasting an incredible season from QB Josh Rosen, who ranks third in the country with 2,354 yards<p><strong>This week:</strong>&nbsp; Against Oregon"
  },
  {
    "week": 7,
    "ranking": 11,
    "team": "Oregon",
    "blurb": "<strong>Record: 4-3, 1-3 </strong><p> Ran the ball 43 times and abandoned the passing game in a 49-7 loss at Stanford without QB Justin Herbert, who is out the next 2-4 weeks due to a collarbone injury. Passed for just 224 yards in past 11 quarters since Herbert went down.<p><strong>This week:</strong>&nbsp; At UCLA"
  },
  {
    "week": 7,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-6, 0-4 </strong><p> If Gary Andersen was going to quit and leave behind $12M, then he should have did it this week when the Beavers have a bye and given interim coach Cory Hall two weeks to get adjusted. Going to be interesting to see who takes this job.<p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 8,
    "ranking": 1,
    "team": "Stanford",
    "blurb": "<strong>Record: 5-2, 4-1 </strong><p> Defense isn’t as stout as previous years, but secondary is one of the best in the country. The Cardinal leads the Pac-12 with a +8 turnover margin.<p><strong>This week:</strong>&nbsp; At Oregon State"
  },
  {
    "week": 8,
    "ranking": 2,
    "team": "Washington",
    "blurb": "<strong>Record: 6-1, 3-1 </strong><p> Coach Chris Petersen may believe otherwise, but Huskies need to win big in home games versus UCLA and Oregon to get back into the CFP conversation.<p><strong>This week:</strong>&nbsp; Against UCLA."
  },
  {
    "week": 8,
    "ranking": 3,
    "team": "Washington State",
    "blurb": "<strong>Record: 7-1, 4-1 </strong><p> Pitched second shutout with a 28-0 win over Colorado for its best start since 2003. Ranked 7th among 129 FBS teams in total defense (274 yards per game). <p><strong>This week:</strong>&nbsp; At Arizona"
  },
  {
    "week": 8,
    "ranking": 4,
    "team": "Arizona State",
    "blurb": "<strong>Record: 4-3, 3-1 </strong><p> The Sun Devils don’t blitz anymore, which had been their trademark, but they’ve allowed just 17 points total to Utah and Washington in past 2 weeks. Still not sure if defensive revival is a fluke, but we’ll know more in their next outing. <p><strong>This week:</strong>&nbsp; Against USC"
  },
  {
    "week": 8,
    "ranking": 5,
    "team": "Arizona",
    "blurb": "<strong>Record: 5-2, 3-1 </strong><p> The Wildcats are 11 points from being undefeated. QB Khalil Tate, who has had a TD run of at least 70 yards the past three weeks, is ascending into Pac-12 MVP territory. <p><strong>This week:</strong>&nbsp; Against Washington State"
  },
  {
    "week": 8,
    "ranking": 6,
    "team": "USC",
    "blurb": "<strong>Record: 6-2, 4-2 </strong><p> Humbled in a 49-14 beatdown at Notre Dame that essentially knocked the Trojans out of the CFP race. Their last impressive outing was a 42-24 win over Stanford in Week 2. <p><strong>This week:</strong>&nbsp; At Arizona State"
  },
  {
    "week": 8,
    "ranking": 7,
    "team": "California",
    "blurb": "<strong>Record: 4-4, 1-4 </strong><p> Just when it looked like the Golden Bears turned the corner following big win at WSU, they suffered a heartbreaking double overtime 45-44 defeat at home to Arizona. Cal is 1-4 in past five games. <p><strong>This week:</strong>&nbsp; At Colorado"
  },
  {
    "week": 8,
    "ranking": 8,
    "team": "UCLA",
    "blurb": "<strong>Record: 4-3, 2-2</strong><p> The Bruins beat up on a hapless Oregon team for a 31-14 victory, but they enter the meat of the their schedule with games at Washington, at Utah, home against ASU, at USC and a regular-season home finale against Cal. <p><strong>This week:</strong>&nbsp; At Washington"
  },
  {
    "week": 8,
    "ranking": 9,
    "team": "Utah",
    "blurb": "<strong>Record: 4-3, 1-3</strong><p> QB Tyler Huntley returned from a four-week absence and threw 4 INTs in a 30-10 home loss to ASU. The Utes started 4-0, but has first 3-game losing streak since 2013. <p><strong>This week:</strong>&nbsp; At Oregon"
  },
  {
    "week": 8,
    "ranking": 10,
    "team": "Colorado",
    "blurb": "<strong>Record: 4-4, 1-4</strong><p> Will Buffaloes return to QB Steven Montez (4-for-13 passing for 21 yards) who was for redshirt freshman Sam Noyer (7-for-18, 53 yards)? Too bad they’re wasting a brilliant season by RB Phillip Lindsay, who ranks sixth nationally with 1,093 yards. <p><strong>This week:</strong>&nbsp; Against California"
  },
  {
    "week": 8,
    "ranking": 11,
    "team": "Oregon",
    "blurb": "<strong>Record: 4-4, 1-4</strong><p> Winless since losing QB Justin Herbert to a broken collarbone. The Ducks have been outscored 106-31 in consecutive losses to WSU, Stanford and UCLA. Herbert returned to practice last week, but is still 1-3 weeks away from returning. <p><strong>This week:</strong>&nbsp; Against Utah"
  },
  {
    "week": 8,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-6, 0-4</strong><p> The Beavers paid $200,000 to a search committee to find its next coach. Seems like a waste when they could seemingly pick from a slew of Pac-12 coordinators, including Washington OC Jonathan Smith, a former OSU standout quarterback. <p><strong>This week:</strong>&nbsp; Against Stanford"
  },
  {
    "week": 9,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record: 7-1, 4-1</strong><p> Second nationally among 129 FBS teams in yards allowed (236.3 per game) and fourth in points surrendered (12.1). <p><strong>This week:</strong>&nbsp; Against Oregon"
  },
  {
    "week": 9,
    "ranking": 2,
    "team": "Arizona",
    "blurb": "<strong>Record: 6-2, 4-1</strong><p> Have won four straight Pac-12 games, its longest streak since the end of the 2014 regular season. The Wildcats haven’t had a five-game Pac-12 winning streak since 1998. First-place in South Division on the line at stake Saturday.<p><strong>This week:</strong>&nbsp; At USC"
  },
  {
    "week": 9,
    "ranking": 3,
    "team": "Stanford",
    "blurb": "<strong>Record: 6-2, 5-1</strong><p> Escaped Oregon State with a 15-14 comeback without RB Bryce Love (ankle). If he doesn’t return, the Cardinal’s five-game winning streak will end Saturday.<p><strong>This week:</strong>&nbsp; At Washington State."
  },
  {
    "week": 9,
    "ranking": 4,
    "team": "USC",
    "blurb": "<strong>Record: 7-2, 5-1</strong><p>QB Sam Darnold, who was projected to be the No. 1 pick in the 2018 NFL draft, may return next season for his junior year. RB Ronald Jones II picked up 216 yards on 18 carries and the Trojans ran for 341 in 48-17 win over Arizona State a week after Notre Dame held them to 76 yards. <p><strong>This week:</strong>&nbsp; At Arizona"
  },
  {
    "week": 9,
    "ranking": 5,
    "team": "Arizona State",
    "blurb": "<strong>Record: 4-4, 3-2</strong><p>Before allowing a whopping 607 yards to USC last Saturday, the Sun Devils had surrendered just 1 play 20 yards or longer the previous two weeks. The Trojans had 9.  <p><strong>This week:</strong>&nbsp; Against Colorado"
  },
  {
    "week": 9,
    "ranking": 6,
    "team": "Washington State",
    "blurb": "<strong>Record: 7-2, 4-2</strong><p>Who’s the QB? Luke Falk needs 132 yards to break the Pac-12’s all-time passing record, but he was replaced by Tyler Hilinski, who tossed 509 yards, 2 TDs and 4 INTs in a loss at Arizona. Former QB Ryan Leaf chimed: “What a mess” via Twitter. <p><strong>This week:</strong>&nbsp; Against Stanford"
  },
  {
    "week": 9,
    "ranking": 7,
    "team": "Oregon",
    "blurb": "<strong>Record: 5-4, 2-4</strong><p>Something has to give when the Ducks’ vaunted rushing attack (256.1 yards per game) faces Washington, which ranks second nationally in rushing yards allowed (71.6). <p><strong>This week:</strong>&nbsp; At Washington"
  },
  {
    "week": 9,
    "ranking": 8,
    "team": "Colorado",
    "blurb": "<strong>Record: 5-4, 2-4</strong><p>After throwing for 21 yards last week, QB Steven Montez had 347 yards and 3 TDs on 20-for-26 passing in a 44-28 win over California. Montez said: “I felt like I had something to prove. … People were doubting me.” <p><strong>This week:</strong>&nbsp; At Arizona State"
  },
  {
    "week": 9,
    "ranking": 9,
    "team": "UCLA",
    "blurb": "<strong>Record: 4-4, 2-3</strong><p>QB Josh Rosen should return this week after being knocked out of last Saturday’s game at UW with a hand injury. Still, he’s 15-12 as a three-year starter in what’s likely his last season with the Bruins. <p><strong>This week:</strong>&nbsp; At Utah"
  },
  {
    "week": 9,
    "ranking": 10,
    "team": "Utah",
    "blurb": "<strong>Record: 4-4, 1-4</strong><p> At one point, the Utes were ranked No. 20 and had a four-game losing streak. Since then, they’ve lost four straight. Managed just 100.5 yards per game in last 2 outings. <p><strong>This week:</strong>&nbsp; Against UCLA"
  },
  {
    "week": 9,
    "ranking": 11,
    "team": "California",
    "blurb": "<strong>Record: 4-5, 1-5</strong><p> The Golden Bears have lost 11 straight Pac-12 road games, which is an ominous trend considering they’ll need a win at Stanford or UCLA (or both) to become bowl eligible. <p><strong>This week:</strong>&nbsp; Against Oregon State"
  },
  {
    "week": 9,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-7, 0-5</strong><p> If the Beavers can recreate last week’s performance, then they’ll snap their six-game losing streak on Saturday and avoid going winless in the Pac-12. <p><strong>This week:</strong>&nbsp; At California"
  },
  {
    "week": 10,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record: 8-1, 5-1</strong><p> The buzz around Dante Pettis, who set a NCAA career record with nine punt TDs, puts the Huskies on the national radar. UW needs all the publicity it can get to get back into the College Football Playoff conversation. A few more lopsided wins like their 38-3 dismantling over Oregon will help too. <p><strong>This week:</strong>&nbsp; At Stanford"
  },
  {
    "week": 10,
    "ranking": 2,
    "team": "USC",
    "blurb": "<strong>Record: 8-2, 6-1 </strong><p> Can secure the Pac-12 South division title and a spot in the conference’s championship game with a win this week. RB Ronald Jones II, who is averaging 205 rushing yards in past two games, is making a late push for the Pac-12 Offensive MVP award. <p><strong>This week:</strong>&nbsp; At Colorado"
  },
  {
    "week": 10,
    "ranking": 3,
    "team": "Washington State",
    "blurb": "<strong>Record: 8-2, 5-2</strong><p> A week after being benched, QB Luke Falk throws for 337 yards and 3 TDs to set the Pac-12 career passing record (13,806) in a 24-21 win over Stanford. WSU is 7-0 at home, but finishes at Utah (which feels like a trap game) and UW. <p><strong>This week:</strong>&nbsp; At Utah"
  },
  {
    "week": 10,
    "ranking": 4,
    "team": "Arizona",
    "blurb": "<strong>Record: 6-3, 4-2 </strong><p>A 49-35 loss at USC snapped the Wildcats’ four-game winning streak, but optimism is still high in Tucson largely because QB Khalil Tate (161 rushing yards, 146 passing yards and 2 TDs) continued his rapid ascension to stardom. Wildcats need to improve defense, which allowed at 600 yards for second straight week.<p><strong>This week:</strong>&nbsp; Against Oregon State"
  },
  {
    "week": 10,
    "ranking": 5,
    "team": "Arizona State",
    "blurb": "<strong>Record: 5-4, 4-2 </strong><p>Clobbered Colorado 41-30 for a nice bounce-back win following a 48-17 loss against USC two weeks ago. Another victory and the Sun Devils are bowl eligible, but coach Todd Graham likely needs a strong finish to guarantee a return next season. <p><strong>This week:</strong>&nbsp; At UCLA"
  },
  {
    "week": 10,
    "ranking": 6,
    "team": "Stanford",
    "blurb": "<strong>Record: 6-3, 5-2</strong><p> Finally made the switch at QB, but redshirt freshman K.J. Costello, who began the season third on the depth chart, completed just 9 of 20 passes for 105 yards against WSU.  The Cardinal, which averages 181.3 passing yards, will continue to struggle until it receives more production throwing the ball. <p><strong>This week:</strong>&nbsp; Against Washington"
  },
  {
    "week": 10,
    "ranking": 7,
    "team": "Utah",
    "blurb": "<strong>Record: 5-4, 2-4</strong><p> October was downright frightful for the Utes, which was 0-4 last month after starting the season 4-0. They began November with a 48-17 win over UCLA. With games against UW and WSU, Utah could play a decisive role in the Pac-12 North race. <p><strong>This week:</strong>&nbsp; Against Washington State"
  },
  {
    "week": 10,
    "ranking": 8,
    "team": "Oregon",
    "blurb": "<strong>Record: 5-5, 2-5</strong><p> Good time for a week off, which gives QB Justin Herbert a little longer to recover from a broken collarbone that's forced him to miss the past five games. He should return next week. If Ducks win out and finish 8-5 (including a bowl victory), then that’s a good start for first-year coach Willie Taggart<p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 10,
    "ranking": 9,
    "team": "Colorado",
    "blurb": "<strong>Record: 5-5. 2-5</strong><p> Reigning Pac-12 South champion was eliminated from division race after a demoralizing 41-30 defeat to ASU in which they squandered a 10-point lead late in the game and was outscored 24-3 in the fourth.<p><strong>This week:</strong>&nbsp; Against USC"
  },
  {
    "week": 10,
    "ranking": 10,
    "team": "California",
    "blurb": "<strong>Record: 5-5, 2-5</strong><p>Following 37-23 win against Oregon State, the Golden Bears have two weeks to prepare for the Big Game at rival Stanford, with bowl implications on the line. Progress has been made under first-year coach Justin Wilcox, particularly with a defense that allows nearly two fewer TDs than last season. <p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 10,
    "ranking": 11,
    "team": "UCLA",
    "blurb": "<strong>Record: 4-5, 2-4</strong><p>QB Josh Rosen is tougher than many would have you believe. He reportedly suffered a concussion two weeks ago at UW, which kept him out last Saturday. His availability this week – and for the rest of the season – is uncertain.  <p><strong>This week:</strong>&nbsp; Against Arizona State"
  },
  {
    "week": 10,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-8, 0-6</strong><p> The Beavers play harder for interim coach Cory Hall than they did for Gary Andersen, who quit on them last month. Still, Hall lost any chance at returning next season last Saturday after a loss to Cal. <p><strong>This week:</strong>&nbsp; At Arizona"
  }
]