[
  {
    "week": 1,
    "ranking": 1,
    "team": "Washington",
    "blurb": "From this vantage point, the playoff path got a tad more difficult Sunday night when LSU looked sharp in dismantling Miami. If Auburn finishes third in the SEC West, the Huskies are in a tenuous position even if they run the table."
  },
  {
    "week": 1,
    "ranking": 2,
    "team": "Stanford",
    "blurb": "In his last four games (Notre Dame, USC, TCU and SDSU), quarterback K.J. Costello has 13 touchdowns and three interceptions."
  },
  {
    "week": 1,
    "ranking": 3,
    "team": "Oregon",
    "blurb": "Justin Herbert’s stat line caught my eye: It’s rare that a quarterback throws for five touchdowns but doesn’t break the 300-yard mark and completes only 40-something percent of his passes."
  },
  {
    "week": 1,
    "ranking": 4,
    "team": "USC",
    "blurb": "JT Daniels throwing to Amon-ra St. Brown as juniors in 2020: Holy crap."
  },
  {
    "week": 1,
    "ranking": 5,
    "team": "Utah",
    "blurb": "Dangerous game this week with Washington around the corner, but this is not the Northern Illinois team of a few years ago. The Huskies were thumped by Iowa in Week One."
  },
  {
    "week": 1,
    "ranking": 6,
    "team": "Colorado",
    "blurb": "Cornhuskers had to cancel their opener because of weather. Could CU have used the game tape for study? Sure. But that loss is more than offset by the fact that Scott Frost’s crew won’t have worked through opening-game jitters and glitches."
  },
  {
    "week": 1,
    "ranking": 7,
    "team": "Arizona State",
    "blurb": "Good to see the Sun Devils plan to “stay humble” after beating a second-tier Conference USA squad, and glad they plan to put on the “big-boy pants” this week. Wish there were a way for Herm Edwards to serve as proxy quote-giver for every other coach in the conference."
  },
  {
    "week": 1,
    "ranking": 8,
    "team": "Cal",
    "blurb": "Huge game for the Bears’ postseason charge: Combine a win in Provo with a victory over Idaho State, and they’re halfway to bowl-eligibility with most of their toughest games at home."
  },
  {
    "week": 1,
    "ranking": 9,
    "team": "Washington State",
    "blurb": "Cougars had 10 penalties, were bad on third down and minus-1 in turnovers … and still won by 22. That’s what red zone perfection will do for you."
  },
  {
    "week": 1,
    "ranking": 10,
    "team": "UCLA",
    "blurb": "To all Bruins fans preparing for the absolute worst, let me remind you of Sept. 13, 2008: Brigham Young 59, UCLA 0. It won’t be that bad in Norman, no way."
  },
  {
    "week": 1,
    "ranking": 11,
    "team": "Arizona",
    "blurb": "The Wildcats’ season changed tints faster than Khalil Tate changes direction, which, by the way, is something they could have used more of."
  },
  {
    "week": 1,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "Beavers gave up 69 points in the ’17 finale and 77 in the ’18 opener. Is that bad?"
  },
  {
    "week": 2,
    "ranking": 1,
    "team": "Washington",
    "blurb": "Huskies lead the conference, and perhaps the country, in one-handed touchdown catches. (Hey, it’s better than not leading in anything.)"
  },
  {
    "week": 2,
    "ranking": 2,
    "team": "Stanford",
    "blurb": "After the Aggies, it’s on to Eugene and South Bend before hosting Utah. If the Cardinal survives that stretch unscathed, the playoff talk will be legit."
  },
  {
    "week": 2,
    "ranking": 3,
    "team": "Oregon",
    "blurb": "It only gets easier for the Ducks, for another week."
  },
  {
    "week": 2,
    "ranking": 4,
    "team": "Arizona State",
    "blurb": "Occurs to me that university enrollment could work against the Sun Devils this week, with the players receiving approximately 72,000 pats on the back. (Slight exaggeration: That figure includes the satellite campuses, as well, but not all the online-only students.)"
  },
  {
    "week": 2,
    "ranking": 5,
    "team": "Colorado",
    "blurb": "If you’re wondering about Laviska Shenault (and you probably should be): He was a 3-star recruit from the Dallas area who had an impressive array of scholarship options, although the Buffs were one of the first to offer."
  },
  {
    "week": 2,
    "ranking": 6,
    "team": "USC",
    "blurb": "On the other hand … The defense was quite good Saturday night, both fundamentally sound and physical. if the offense is merely decent, the Trojans should be just fine."
  },
  {
    "week": 2,
    "ranking": 7,
    "team": "Cal",
    "blurb": "The QB situation, with 2017 starter Ross Bowers apparently relegated to third string without a bad performance necessitating the demotion, is a tad unusual. That said, defense travels."
  },
  {
    "week": 2,
    "ranking": 8,
    "team": "Utah",
    "blurb": "“We’re a pretty average football team right now, at best,” Kyle Whittingham said. It’s true, but it shouldn’t be: With all the returning starters (and scheme), I expected the offense to be more efficient."
  },
  {
    "week": 2,
    "ranking": 9,
    "team": "Washington State",
    "blurb": "Any optimism based on the resounding win over Wyoming should perhaps consider this score: Missouri 40, Wyoming 13. (No, I’m not sold on the Cougars. Not close to sold.)"
  },
  {
    "week": 2,
    "ranking": 10,
    "team": "UCLA",
    "blurb": "Let’s say the Bruins are 0-4 or 1-3 when decision day arrives for Dorian Thompson-Robinson: Should they toss the red shirt on him to avoid blowing a year on a lost season? Just thinkin’ out loud."
  },
  {
    "week": 2,
    "ranking": 11,
    "team": "Oregon State",
    "blurb": "After the trip to Reno, the Beavers will have three of the next four at home (Arizona, Cal and WSU). Do I hear 5-1? They couldn’t .. they wouldn’t … they can’t …"
  },
  {
    "week": 2,
    "ranking": 12,
    "team": "Arizona",
    "blurb": "Didn’t think I would type this sentence this fall, but circumstances have changed, so here goes: The Red-Blue scrimmage is Oct. 14."
  },
  {
    "week": 3,
    "ranking": 1,
    "team": "Washington",
    "blurb": "The fate of the season depends not on Jake Browning’s handling of blitzes but on how quickly the injury-plagued offensive line coalesces. Until it does, the defense must lead the way. (From here, the OL’s deadline looks to be Oct. 13, when the Huskies visit Eugene.)"
  },
  {
    "week": 3,
    "ranking": 2,
    "team": "Stanford",
    "blurb": "The brutal back-to-back has arrived. If the Cardinal remains undefeated when it departs Notre Dame Stadium on the evening of Sept. 29, then it will be time to start talking playoff paths. (Of course, USC is not helping the resume much.)"
  },
  {
    "week": 3,
    "ranking": 3,
    "team": "Oregon",
    "blurb": "Allow the Hotline to summarize Oregon’s performance not with one word but one letter: Zzzzzzzzzzzz. A team can face only so many cupcakes before it starts to cast an eye forward and lose sight of the tasks at hand."
  },
  {
    "week": 3,
    "ranking": 4,
    "team": "Cal",
    "blurb": "Having watched Chase Garbers closely for two games, we’ll say this: He gives the receivers a chance to make a play on every throw: The placement and touch are impressive."
  },
  {
    "week": 3,
    "ranking": 5,
    "team": "Colorado",
    "blurb": "It’s unfair to completely dismiss the Buffs’ victory in Lincoln based on Nebraska’s loss to Troy, given that the latter result came with a walk-on quarterback. So we will suggest a partial discount."
  },
  {
    "week": 3,
    "ranking": 6,
    "team": "Arizona State",
    "blurb": "Watching the second half unfold Saturday night, I kept thinking: That’s the ASU defense I expect to see this season. Any level of play above that standard, whether for short or long stretches, will be a credit to Danny Gonzales and the defensive staff. The Sun Devils simply don’t have the personnel."
  },
  {
    "week": 3,
    "ranking": 7,
    "team": "Washington State",
    "blurb": "Difficult to know what to make of the Cougars: Their three opponents thus far have combined for one win over FBS teams, and that was Wyoming’s victory over mighty New Mexico State. It’s the softest schedule east of Eugene."
  },
  {
    "week": 3,
    "ranking": 8,
    "team": "Utah",
    "blurb": "On the bright side: The defense should keep the Utes in every game — at least until it reaches the point of physical and mental exhaustion from playing each week with zero margin for error. That’s the issue (or one of the issues) for Whittingham and Taylor: Fixing the offense before the defense hits its limit."
  },
  {
    "week": 3,
    "ranking": 9,
    "team": "USC",
    "blurb": "Speaking of fixing the offense … The Hotline went back through the official stats and found this first-quarter play selection from the Trojans: pass, pass, pass, run (3), pass, pass, pass, pass, run (23, TD), pass, pass, pass, pass, pass, pass, pass, pass, run (1), pass, pass, run (3), pass, run (3, TD). Hmmmm."
  },
  {
    "week": 3,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "Sure, 62 points and five touchdowns passes by Khalil Tate are reasons for Wildcats fans to exhale. But here’s a reason to fret: 44.23. That’s the third-down conversion percentage allowed by Arizona’s defense. In conference, only two are worse: Oregon State and UCLA. In all major college football, only 21 are worse."
  },
  {
    "week": 3,
    "ranking": 11,
    "team": "Oregon State",
    "blurb": "Oh, Beavs. So, so, so close. On the bright side: They rallied from 30-7 down and have multiple winnable games coming up, starting Saturday."
  },
  {
    "week": 3,
    "ranking": 12,
    "team": "UCLA",
    "blurb": "Speaking of winnable games: The Bruins appear to have one on Oct. 20 (Arizona) and another on Oct. 26 (Utah). Anything else would be a sizable upset until, say, the middle of 2019."
  },
  {
    "week": 4,
    "ranking": 1,
    "team": "Stanford",
    "blurb": "Right now, on a neutral field, Stanford beats Washington. But the Huskies have more room to improve over the six weeks before they collide in Seattle."
  },
  {
    "week": 4,
    "ranking": 2,
    "team": "Washington",
    "blurb": "Might as well mark (in ink) 27-20 or 24-14 as the final score of every UW game, with only the ID of the victor in doubt. As currently constructed, the Huskies don’t have the personnel to win 45-10."
  },
  {
    "week": 4,
    "ranking": 3,
    "team": "Oregon",
    "blurb": "In Eugene, they will be talking about (and brooding over) that loss for a long, long time. If the Ducks themselves haven’t already forgotten about it, they’re in deep trouble in Berkeley."
  },
  {
    "week": 4,
    "ranking": 4,
    "team": "Cal",
    "blurb": "Circumstances couldn’t have unfolded any better for the rested Bears, who are lying in wait for the staggering Ducks. The last Oregon visit to Berkeley featured 101 points and 1,100 yards. Look for half those totals this time."
  },
  {
    "week": 4,
    "ranking": 5,
    "team": "Colorado",
    "blurb": "The division is there for the taking, but the Buffs cannot afford to lose a game they should win. The next two, UCLA and ASU — both at home — qualify as games a division champ should win."
  },
  {
    "week": 4,
    "ranking": 6,
    "team": "USC",
    "blurb": "USC’s national rankings: No. 107 in yards per rush (3.61), No. 117 in rushing yards per game (110.3) and No. 122 in attempts per game (30.5). It’s like the Trojans have become …"
  },
  {
    "week": 4,
    "ranking": 7,
    "team": "Washington State",
    "blurb": "Hard not to be impressed with Gardner Minshew’s performance, but I wonder how the coming chess match will unfold between WSU and opposing defenses with all tactics on display each week."
  },
  {
    "week": 4,
    "ranking": 8,
    "team": "Arizona State",
    "blurb": "Trap-game alert for the Sun Devils after two tough road losses and with a big trip to Boulder next week — Sorry, I meant gargantuan — but their opponent has no teeth. We’ll take Eno Benjamin OVER 175 yards."
  },
  {
    "week": 4,
    "ranking": 9,
    "team": "Arizona",
    "blurb": "Houston? What about Houston? It’s like those three hours on the Gulf never happened … almost. The lone lingering issue, Khalil Tate’s tweaked ankle, is significant this week against USC’s QB-hunting edge rushers."
  },
  {
    "week": 4,
    "ranking": 10,
    "team": "Utah",
    "blurb": "With no Week Four result to divert our attention, the Utes’ performance against Washington has gotten more gruesome in the mind’s eye. Fascinated to see what changes, if any, the bye week has brought."
  },
  {
    "week": 4,
    "ranking": 11,
    "team": "Oregon State",
    "blurb": "That was one giant 8.7-yards-per-carry-allowed dose of reality, wasn’t it?"
  },
  {
    "week": 4,
    "ranking": 12,
    "team": "UCLA",
    "blurb": "Chip Kelly dubbed the bye “Improvement Week.” We hear the other options considered were “Thank Goodness We Don’t Have To Play Week” and “Maybe Everyone Will Forget How Bad We Looked Week.”"
  },
  {
    "week": 5,
    "ranking": 1,
    "team": "Washington",
    "blurb": "From the maybe-it’s-just-me files: Salvon Ahmed is averaging 7.9 yards per carry in the past two games; seems like one option for the Huskies would be to USE HIM MORE."
  },
  {
    "week": 5,
    "ranking": 2,
    "team": "Oregon",
    "blurb": "Had the Ducks slotted behind Stanford on my top-25 ballot, which is based largely on quantifiable factors/guidelines set by the AP. These power ratings are far more subjective. Right now, Oregon’s better."
  },
  {
    "week": 5,
    "ranking": 3,
    "team": "Stanford",
    "blurb": "Yes, it was a difficult back-to-back, especially given the taxing nature of the game in Eugene. But there’s more to the situation: The Cardinal is underperforming on both lines. (We expected that on defense, not offense.)"
  },
  {
    "week": 5,
    "ranking": 4,
    "team": "Colorado",
    "blurb": "We mentioned the soft schedule in ‘Saturday Night Five,’ but it gets more difficult quickly with ASU this week and then a trip to the Coliseum, where the Trojans will be coming off a bye."
  },
  {
    "week": 5,
    "ranking": 5,
    "team": "USC",
    "blurb": "Eighteen penalties. Eight. Teen. (That should be in the ‘termination with cause’ section of every coach’s contract.)"
  },
  {
    "week": 5,
    "ranking": 6,
    "team": "Washington State",
    "blurb": "Gigantic victory for the Cougars, who are now two wins from bowl-eligibility. Take care of business in Corvallis, and they’ll have enough cushion in October/November to stretch from Pullman to Colfax (while abiding by the speed limit, of course)."
  },
  {
    "week": 5,
    "ranking": 7,
    "team": "Arizona State",
    "blurb": "The good and bad for ASU … make that the bad and the good: Oregon State’s Jermar Jefferson rushed for 254 yards Saturday but wasn’t close to the most-productive tailback on the field."
  },
  {
    "week": 5,
    "ranking": 8,
    "team": "Cal",
    "blurb": "Disappointing performance by the Bears, who had five turnovers and yielded two defensive touchdowns to Oregon. Would have expected that type of inefficiency in late Sept. 2017, not 2018."
  },
  {
    "week": 5,
    "ranking": 9,
    "team": "Arizona",
    "blurb": "Plus-two in turnovers and plus-10 in penalties and not really in the game for 58 minutes because the narrative remains unchanged: Regardless of coach, quarterback or system, Arizona cannot handle USC on the line of scrimmage."
  },
  {
    "week": 5,
    "ranking": 10,
    "team": "Utah",
    "blurb": "Picked by some to win the South and by many to contend in the South, the Utes need a substantial upset to avoid an 0-3 start. On the bright side: Their defense and running game should match up well with Stanford."
  },
  {
    "week": 5,
    "ranking": 11,
    "team": "Oregon State",
    "blurb": "We have a major story developing, folks: The emergence of a Pac-12 run defense that’s actually worse than what we saw from UCLA last year. I didn’t think it was possible …"
  },
  {
    "week": 5,
    "ranking": 12,
    "team": "UCLA",
    "blurb": "Total yards in the second half: Colorado 281, UCLA 98. Which is worse? The latter: Repeated three-and-outs in the altitude are a recipe for collapse on defense."
  }
]